---
kind: method
id: M:Autodesk.Revit.DB.Mechanical.DuctSizeSettings.GetEnumerator
source: html/03568478-23c1-d14e-f151-f283d600f7a3.htm
---
# Autodesk.Revit.DB.Mechanical.DuctSizeSettings.GetEnumerator Method

Returns an enumerator that iterates through a collection.

## Syntax (C#)
```csharp
public virtual IEnumerator<KeyValuePair<DuctShape, DuctSizes>> GetEnumerator()
```

## Returns
An IEnumerator object that can be used to iterate through the collection.